Adam learning_rate:<tensorflow.python.keras.optimizer_v2.adam.Adam object at 0x00000252424E9088> 
Model: "config1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 2)                 64        
_________________________________________________________________
dense (Dense)                (None, 2)                 6         
_________________________________________________________________
dense_1 (Dense)              (None, 3)                 9         
_________________________________________________________________
flatten (Flatten)            (None, 3)                 0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 8         
=================================================================
Total params: 87
Trainable params: 87
Non-trainable params: 0
_________________________________________________________________
